{
  "100": "Everything so far is OK and the client should continue the request, or ignore the response if the request is already finished.",
  "101": "In response to an Upgrade request header from the client, the server is switching to a different protocol.",
  "102": "The server has received and is processing the request, but no response is available yet.",
  "103": "The client may start preloading resources while the server prepares a response.",
  "200": "The request has succeeded. The meaning of the success depends on the HTTP method.",
  "201": "The request has succeeded and a new resource has been created as a result.",
  "202": "The request has been received but not yet acted upon.",
  "203": "The returned meta-information is not exactly the same as is available from the origin server, but is collected from a local or a third-party copy.",
  "204": "There is no content to send for this request, but the headers may be useful.",
  "206": "The Range header was sent from the client to request only part of the requested resource.",
  "207": "Multiple status codes apply to this request.",
  "226": "The server has fulfilled a GET request for the resource, and the response is a representation of the result of one or more instance-manipulations applied to the current instance.",
  "300": "The request has more than one possible response.",
  "301": "The URL of the requested resource has been changed permanently.",
  "302": "The URL of requested resource has been changed temporarily.",
  "303": "The client should redirect the request to another URL with a GET request.",
  "305": "The requested response must be accessed by a proxy.",
  "307": "The client should redirect the request to another URL with same method that was used in this request.",
  "308": "The resource is now permanently located at another URL.",
  "400": "The server could not understand the request due to invalid syntax.",
  "401": "The client must authenticate to access the requested resource.",
  "402": "Access to the requested resource requires payment.",
  "403": "Though authenticated, the client does not have access rights to the requested resource.",
  "404": "The server can not find the requested resource.",
  "405": "The request method is known to the server but has been disabled and cannot be used.",
  "406": "The server could not find any content that conforms to the criteria given by the user agent.",
  "407": "The client must authenticate by a proxy to access the requested resource.",
  "408": "The server has detected an idle connection and would like to close it.",
  "409": "The request conflicts with the current state of the server.",
  "410": "The requested resource has been permanently deleted from server, with no forwarding address.",
  "411": "Server rejected the request because the Content-Length header field is not defined and the server requires it.",
  "412": "The client has indicated preconditions in its headers which the server does not meet.",
  "413": "The request entity is larger than limits defined by server.",
  "414": "The URI requested by the client is longer than the server is willing to interpret.",
  "415": "The media format of the requested data is not supported by the server, so the server is rejecting the request.",
  "416": "The range specified by the Range header field in the request can't be fulfilled; it's possible that the range is outside the size of the target URI's data.",
  "417": "The expectation indicated by the Expect request header field can't be met by the server.",
  "418": "The server refuses the attempt to brew coffee with a teapot.",
  "421": "The request was directed at a server that is not able to produce a response.",
  "422": "The request was well-formed but was unable to be followed due to semantic errors.",
  "423": "The requested resource is locked.",
  "424": "The request failed due to failure of a previous request.",
  "425": "The server is unwilling to risk processing a request that might be replayed.",
  "426": "The server refuses to perform the request using the current protocol but might be willing to do so after the client upgrades to a different protocol. ",
  "428": "The origin server requires the request to be conditional.",
  "429": "The user has sent too many requests in a given amount of time.",
  "431": "The server is unwilling to process the request because its header fields are too large. ",
  "451": "The user-agent requested a resource that cannot legally be provided.",
  "500": "The server has encountered a situation it doesn't know how to handle.",
  "501": "The request method is not supported by the server and cannot be handled.",
  "502": "The server got an invalid response while working as a gateway to get a response needed to handle the request.",
  "503": "The server is not ready to handle the request. Common causes are a server that is down for maintenance or that is overloaded.",
  "504": "The server is acting as a gateway and cannot get a response in time.",
  "505": "The HTTP version used in the request is not supported by the server.",
  "506": "The server has an internal configuration error: the chosen variant resource is configured to engage in transparent content negotiation itself, and is therefore not a proper end point in the negotiation process.",
  "507": "The method could not be performed on the resource because the server is unable to store the representation needed to successfully complete the request.",
  "508": "The server detected an infinite loop while processing the request.",
  "509": "The server cannot provide the requested resource without exceeding bandwidth limits.",
  "510": "Further extensions to the request are required for the server to fulfil it.",
  "511": "The client must authenticate to gain network access."
}
